In [1]:
import pandas as pd
import numpy as np

In [2]:
dict1 = {
    "name":['harry', 'rohan', 'skillful','shubh'],
    "marks":[92, 34, 24, 17],
    "city":['rampur', 'kolkata', 'bareilly', 'antarctica']
}

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

       name  marks        city
0     harry     92      rampur
1     rohan     34     kolkata
2  skillful     24    bareilly
3     shubh     17  antarctica

In [5]:
df.to_csv('friends.csv')

In [6]:
df.to_csv('friends_index_false.csv', index=False)

In [7]:
df.head(2)

    name  marks     city
0  harry     92   rampur
1  rohan     34  kolkata

In [8]:
df.tail(2)

       name  marks        city
2  skillful     24    bareilly
3     shubh     17  antarctica

In [9]:
df.describe()

          marks
count   4.00000
mean   41.75000
std    34.21866
min    17.00000
25%    22.25000
50%    29.00000
75%    48.50000
max    92.00000